module.exports = {
	// يمكنك تخصيص اللغة هنا أو مباشرةً في ملفات الأوامر من قبل ShAn
	onlyadminbox: {
		description: "تفعيل/إيقاف وضع السماح للاستخدام فقط لمسؤولي المجموعة",
		guide: "   {pn} [on | off]",
		text: {
			turnedOn: "تم تفعيل الوضع: فقط مسؤولو المجموعة يمكنهم استخدام البوت",
			turnedOff: "تم إيقاف الوضع: يمكن لجميع الأعضاء استخدام البوت",
			syntaxError: "خطأ في الصياغة، استخدم فقط {pn} on أو {pn} off"
		}
	},
	adduser: {
		description: "إضافة مستخدم إلى دردشة مجموعتك",
		guide: "   {pn} [رابط الملف الشخصي | uid]",
		text: {
			alreadyInGroup: "موجود بالفعل في المحادثة",
			successAdd: "- تم إضافة %1 عضو بنجاح إلى المجموعة",
			failedAdd: "- فشل في إضافة %1 عضو إلى المجموعة",
			approve: "- تم إضافة %1 عضو إلى قائمة الانتظار للموافقة",
			invalidLink: "يرجى إدخال رابط فيسبوك صالح",
			cannotGetUid: "لا يمكن جلب uid لهذا المستخدم",
			linkNotExist: "هذا الرابط الشخصي غير موجود",
			cannotAddUser: "البوت ممنوع أو هذا المستخدم منع استقبال الدعوات من الغرباء"
		}
	},
	admin: {
		description: "إضافة، إزالة أو تعديل دور المسؤول",
		guide: "   {pn} [add | -a] <uid>: إضافة دور مسؤول للمستخدم\n\t  {pn} [remove | -r] <uid>: إزالة دور المسؤول\n\t  {pn} [list | -l]: عرض جميع المسؤولين",
		text: {
			added: "✅ | تم إضافة دور المسؤول لعدد %1 من المستخدمين:\n%2",
			alreadyAdmin: "\n⚠️ | %1 مستخدم لديهم دور المسؤول مسبقًا:\n%2",
			missingIdAdd: "⚠️ | الرجاء إدخال الـ ID أو الإشارة للمستخدم لإضافة دور المسؤول",
			removed: "✅ | تم إزالة دور المسؤول عن %1 من المستخدمين:\n%2",
			notAdmin: "⚠️ | %1 مستخدم ليس لديهم دور المسؤول:\n%2",
			missingIdRemove: "⚠️ | الرجاء إدخال الـ ID أو الإشارة للمستخدم لإزالة دور المسؤول",
			listAdmin: "👑 | قائمة المسؤولين:\n%1"
		}
	},
	adminonly: {
		description: "تفعيل/إيقاف وضع أن تكون الأوامر مخصصة للمسؤولين فقط",
		guide: "{pn} [on | off]",
		text: {
			turnedOn: "تم تفعيل الوضع: فقط المسؤولون يمكنهم استخدام البوت",
			turnedOff: "تم إيقاف الوضع: يمكن للجميع استخدام البوت",
			syntaxError: "خطأ في الصياغة، استخدم فقط {pn} on أو {pn} off"
		}
	},
	all: {
		description: "مناداة جميع أعضاء مجموعتك",
		guide: "{pn} [المحتوى | فارغ]"
	},
	anime: {
		description: "صورة أنمي عشوائية",
		guide: "{pn} <endpoint>\n   قائمة النهايات: neko, kitsune, hug, pat, waifu, cry, kiss, slap, smug, punch",
		text: {
			loading: "جارٍ تهيئة الصورة، الرجاء الانتظار...",
			error: "حدث خطأ، حاول مرة أخرى لاحقًا"
		}
	},
	antichangeinfobox: {
		description: "تفعيل/إيقاف الحماية من تغيير معلومات المجموعة",
		guide: "   {pn} avt [on | off]: حماية من تغيير صورة المجموعة\n   {pn} name [on | off]: حماية من تغيير اسم المجموعة\n   {pn} theme [on | off]: حماية من تغيير السمة\n   {pn} emoji [on | off]: حماية من تغيير الإيموجي",
		text: {
			antiChangeAvatarOn: "تم تفعيل حماية تغيير صورة المجموعة",
			antiChangeAvatarOff: "تم إيقاف حماية تغيير صورة المجموعة",
			missingAvt: "لم تقم بتعيين صورة للمجموعة",
			antiChangeNameOn: "تم تفعيل حماية تغيير اسم المجموعة",
			antiChangeNameOff: "تم إيقاف حماية تغيير اسم المجموعة",
			antiChangeThemeOn: "تم تفعيل حماية تغيير سمة المجموعة",
			antiChangeThemeOff: "تم إيقاف حماية تغيير سمة المجموعة",
			antiChangeEmojiOn: "تم تفعيل حماية تغيير إيموجي المجموعة",
			antiChangeEmojiOff: "تم إيقاف حماية تغيير إيموجي المجموعة",
			antiChangeAvatarAlreadyOn: "حماية تغيير صورة المجموعة مفعلة بالفعل",
			antiChangeNameAlreadyOn: "حماية تغيير اسم المجموعة مفعلة بالفعل",
			antiChangeThemeAlreadyOn: "حماية تغيير سمة المجموعة مفعلة بالفعل",
			antiChangeEmojiAlreadyOn: "حماية تغيير إيموجي المجموعة مفعلة بالفعل"
		}
	},
	appstore: {
		description: "البحث عن التطبيقات في App Store",
		text: {
			missingKeyword: "لم تدخل أي كلمة بحث",
			noResult: "لا توجد نتائج للكلمة %1"
		}
	},
	autosetname: {
		description: "تغيير اللقب تلقائيًا للأعضاء الجدد",
		guide: "   {pn} set <nickname>: تعيين إعدادات تغيير اللقب التلقائي مع بعض الاختصارات:\n   + {userName}: اسم العضو الجديد\n   + {userID}: معرف العضو\n   مثال:\n    {pn} set {userName} ــ",
		text: {
			missingConfig: "الرجاء إدخال الإعداد المطلوب",
			configSuccess: "تم حفظ الإعداد بنجاح",
			currentConfig: "الإعداد الحالي autoSetName في مجموعتك:\n%1",
			notSetConfig: "مجموعةك لم تقم بتعيين إعداد autoSetName",
			syntaxError: "خطأ في الصياغة، استخدم فقط \"{pn} on\" أو \"{pn} off\"",
			turnOnSuccess: "تم تفعيل ميزة تغيير الألقاب تلقائيًا",
			turnOffSuccess: "تم إيقاف ميزة تغيير الألقاب تلقائيًا",
			error: "حدث خطأ أثناء استخدام الميزة، حاول إيقاف رابط الدعوة في المجموعة ثم جرب لاحقًا"
		}
	},
	avatar: {
		description: "إنشاء صورة رمزية أنمي بتوقيع",
		guide: "{p}{n} <معرف الشخصية أو اسمها> | <نص الخلفية> | <التوقيع> | <اسم لون الخلفية أو رمز سداسي>\n{p}{n} help: عرض كيفية استخدام الأمر",
		text: {
			initImage: "جارٍ تهيئة الصورة، الرجاء الانتظار...",
			invalidCharacter: "حاليًا يوجد فقط %1 شخصية في النظام، الرجاء إدخال معرف شخصية أقل من ذلك",
			notFoundCharacter: "لم يتم العثور على شخصية باسم %1 في القائمة",
			errorGetCharacter: "حدث خطأ عند جلب بيانات الشخصية:\n%1: %2",
			success: "✅ صورتك الرمزية\nالشخصية: %1\nالمعرف: %2\nنص الخلفية: %3\nالتوقيع: %4\nاللون: %5",
			defaultColor: "افتراضي",
			error: "حدث خطأ\n%1: %2"
		}
	},
	badwords: {
		description: "تفعيل/إيقاف/إضافة/حذف كلمات مسيئة؛ عند المخالفة يتم التحذير، والمرة الثانية يتم الطرد",
		guide: "   {pn} add <كلمات>: إضافة كلمات محظورة (يمكن إضافة كلمات متعددة مفصولة بفواصل \",\" أو شرطات رأسية \"|\")\n   {pn} delete <كلمات>: حذف كلمات محظورة (يمكن حذف عدة كلمات ... )",
		text: {
			onText: "تشغيل",
			offText: "إيقاف",
			onlyAdmin: "⚠️ | فقط المسؤولون يمكنهم إضافة كلمات محظورة",
			missingWords: "⚠️ | لم تدخل كلمات محظورة",
			addedSuccess: "✅ | تمت إضافة %1 كلمة محظورة إلى القائمة",
			alreadyExist: "❌ | %1 كلمة محظورة كانت موجودة مسبقًا: %2",
			tooShort: "⚠️ | %1 كلمة لا يمكن إضافتها لأنها أقصر من حرفين: %2",
			onlyAdmin2: "⚠️ | فقط المسؤولون يمكنهم حذف كلمات من القائمة",
			missingWords2: "⚠️ | لم تدخل كلمات للحذف",
			deletedSuccess: "✅ | تم حذف %1 كلمة محظورة من القائمة",
			notExist: "❌ | %1 كلمة محظورة لم تكن موجودة مسبقًا: %2",
			emptyList: "⚠️ | قائمة الكلمات المحظورة في مجموعتك فارغة حاليًا",
			badWordsList: "📑 | قائمة الكلمات المحظورة في مجموعتك: %1",
			onlyAdmin3: "⚠️ | فقط المسؤولون يمكنهم %1 هذه الميزة",
			turnedOnOrOff: "✅ | تم %1 تحذير الكلمات المحظورة",
			onlyAdmin4: "⚠️ | فقط المسؤولون يمكنهم حذف تحذيرات الكلمات المحظورة",
			missingTarget: "⚠️ | لم تدخل معرف المستخدم أو تشير إلى المستخدم",
			notWarned: "⚠️ | المستخدم %1 لم يتم تحذيره من قبل",
			removedWarn: "✅ | تمت إزالة تحذير واحد من المستخدم %1 | %2",
			warned: "⚠️ | تم اكتشاف الكلمة المحظورة \"%1\" في رسالتك، إن واصلت سيتم طردك من المجموعة.",
			warned2: "⚠️ | تم اكتشاف الكلمة المحظورة \"%1\" في رسالتك، هذه هي المرة الثانية وسيتم طردك من المجموعة.",
			needAdmin: "البوت يحتاج صلاحيات مسؤول لطرد الأعضاء المخالفين",
			unwarned: "✅ | تمت إزالة تحذيرات الكلمات المحظورة للمستخدم %1 | %2"
		}
	},
	balance: {
		description: "عرض أموالك أو أموال الشخص المشار إليه",
		guide: "   {pn}: عرض أموالك\n   {pn} <@tag>: عرض أموال الشخص المشار إليه",
		text: {
			money: "لديك %1$",
			moneyOf: "%1 لديه %2$"
		}
	},
	batslap: {
		description: "صورة ضربة بالمضرب",
		text: {
			noTag: "يجب عليك إشارة الشخص الذي تريد أن تضربه"
		}
	},
	busy: {
		description: "تفعيل وضع عدم الإزعاج؛ عندما تتم الإشارة إليك سيخبرك البوت",
		guide: "   {pn} [فارغ | <السبب>]: تفعيل وضع عدم الإزعاج\n   {pn} off: إيقاف وضع عدم الإزعاج",
		text: {
			turnedOff: "✅ | تم إيقاف وضع عدم الإزعاج",
			turnedOn: "✅ | تم تفعيل وضع عدم الإزعاج",
			turnedOnWithReason: "✅ | تم تفعيل وضع عدم الإزعاج مع السبب: %1",
			alreadyOn: "المستخدم %1 مشغول حاليًا",
			alreadyOnWithReason: "المستخدم %1 مشغول حاليًا بالسبب: %2"
		}
	},
	callad: {
		description: "إرسال تقرير/ملاحظات/بلاغ إلى مدير البوت",
		guide: "   {pn} <الرسالة>",
		text: {
			missingMessage: "الرجاء إدخال الرسالة التي تريد إرسالها للمدير",
			sendByGroup: "\n- مرسلة من المجموعة: %1\n- Thread ID: %2",
			sendByUser: "\n- مرسلة من المستخدم",
			content: "\n\nالمحتوى:\n─────────────────\n%1\n─────────────────\nرد على هذه الرسالة للرد على المستخدم",
			success: "تم إرسال رسالتك إلى المدير بنجاح!",
			reply: "📍 رد من المدير %1:\n─────────────────\n%2\n─────────────────\nرد على هذه الرسالة لمتابعة الإرسال للمستخدم",
			replySuccess: "تم إرسال ردك إلى المدير بنجاح!",
			feedback: "📝 ملاحظات من المستخدم %1:\n- User ID: %2%3\n\nالمحتوى:\n─────────────────\n%4\n─────────────────\nرد على هذه الرسالة[...]",
			replyUserSuccess: "تم إرسال ردك للمستخدم بنجاح!"
		}
	},
	cmd: {
		description: "إدارة ملفات الأوامر",
		guide: "{pn} load <اسم ملف الأمر>\n{pn} loadAll\n{pn} install <url> <اسم الملف>: تحميل وتثبيت ملف أمر من رابط (raw)",
		text: {
			missingFileName: "⚠️ | الرجاء إدخال اسم الأمر لإعادة التحميل",
			loaded: "✅ | تم تحميل الأمر \"%1\" بنجاح",
			loadedError: "❌ | فشل تحميل الأمر \"%1\" بالخطأ\n%2: %3",
			loadedSuccess: "✅ | تم تحميل الأمر \"%1\" بنجاح",
			loadedFail: "❌ | فشل تحميل الأمر \"%1\"\n%2",
			missingCommandNameUnload: "⚠️ | الرجاء إدخال اسم الأمر الذي تريد إزالته",
			unloaded: "✅ | تم إلغاء تحميل الأمر \"%1\" بنجاح",
			unloadedError: "❌ | فشل إلغاء تحميل الأمر \"%1\" بالخطأ\n%2: %3",
			missingUrlCodeOrFileName: "⚠️ | الرجاء إدخال الرابط أو الكود واسم ملف الأمر الذي تريد تثبيته",
			missingUrlOrCode: "⚠️ | الرجاء إدخال الرابط أو الكود لملف الأمر الذي تريد تثبيته",
			missingFileNameInstall: "⚠️ | الرجاء إدخال اسم الملف لحفظ الأمر (بلاحقة .js)",
			invalidUrlOrCode: "⚠️ | لا يمكن الحصول على كود الأمر",
			alreadExist: "⚠️ | ملف الأمر موجود بالفعل، هل تريد استبداله؟\nتفاعل مع هذه الرسالة للاستمرار",
			installed: "✅ | تم تثبيت الأمر \"%1\" بنجاح، الملف محفوظ في %2",
			installedError: "❌ | فشل تثبيت الأمر \"%1\" بالخطأ\n%2: %3",
			missingFile: "⚠️ | ملف الأمر \"%1\" غير موجود",
			invalidFileName: "⚠️ | اسم ملف غير صالح",
			unloadedFile: "✅ | تم إلغاء تحميل الأمر \"%1\""
		}
	},
	count: {
		description: "عرض عدد الرسائل لكل الأعضاء أو لنفسك (منذ انضمام البوت للمجموعة)",
		guide: "   {pn}: عرض عدد رسائلك\n   {pn} @tag: عرض عدد رسائل الشخص المشار إليه\n   {pn} all: عرض عدد رسائل جميع الأعضاء",
		text: {
			count: "عدد رسائل الأعضاء:",
			endMessage: "المستخدمون الذين لا يظهر لهم اسم في القائمة لم يرسلوا أي رسائل.",
			page: "صفحة [%1/%2]",
			reply: "رد على هذه الرسالة برقم الصفحة لعرض المزيد",
			result: "%1 ترتيب %2 بعدد %3 رسائل",
			yourResult: "أنت في الترتيب %1 وأرسلت %2 رسالة في هذه المجموعة",
			invalidPage: "رقم صفحة غير صالح"
		}
	},
	customrankcard: {
		description: "تصميم بطاقة الترتيب بنفسك",
		guide: {
			body: "   {pn} [maincolor | subcolor | linecolor | progresscolor | alphasubcolor | textcolor | namecolor | expcolor | rankcolor | levelcolor | reset] <القيمة>"
				+ "\n   حيث:"
				+ "\n  + maincolor | background <القيمة>: الخلفية الرئيسية لبطاقة الترتيب"
				+ "\n  + subcolor <القيمة>: الخلفية الفرعية"
				+ "\n  + linecolor <القيمة>: لون الخط الفاصل بين الخلفية الرئيسية والفرعية"
				+ "\n  + expbarcolor <القيمة>: لون شريط الخبرة"
				+ "\n  + progresscolor <القيمة>: لون تقدم الخبرة الحالي"
				+ "\n  + alphasubcolor <القيمة>: شفافية الخلفية الفرعية (من 0 -> 1)"
				+ "\n  + textcolor <القيمة>: لون النص (hex أو rgba)"
				+ "\n  + namecolor <القيمة>: لون الاسم"
				+ "\n  + expcolor <القيمة>: لون الخبرة"
				+ "\n  + rankcolor <القيمة>: لون الرتبة"
				+ "\n  + levelcolor <القيمة>: لون المستوى"
				+ "\n    • <القيمة> يمكن أن تكون رمزًا سداسيًا، rgb، rgba، تدرج لوني (يفصل بين الألوان بمسافة) أو رابط صورة"
				+ "\n    • إذا أردت استخدام تدرج، أدخل عدة ألوان مفصولة بمسافة"
				+ "\n   {pn} reset: إعادة كل الإعدادات للافتراضي"
				+ "\n   مثال:"
				+ "\n    {pn} maincolor #fff000"
				+ "\n    {pn} subcolor rgba(255,136,86,0.4)"
				+ "\n    {pn} reset",
			attachment: {
				[`${process.cwd()}/scripts/cmds/assets/guide/customrankcard_1.jpg`]: "https://i.ibb.co/BZ2Qgs1/image.png",
				[`${process.cwd()}/scripts/cmds/assets/guide/customrankcard_2.png`]: "https://i.ibb.co/wy1ZHHL/image.png"
			}
		},
		text: {
			invalidImage: "رابط صورة غير صالح، الرجاء اختيار رابط مباشر لصورة (jpg, jpeg, png, gif). يمكنك رفع الصورة على https://imgbb.com/ والحصول على \"direct link\"",
			invalidAttachment: "ملف مرفق غير صالح، الرجاء اختيار ملف صورة",
			invalidColor: "رمز لون غير صالح، الرجاء اختيار رمز سداسي مكون من 6 خانات أو rgba صالح",
			notSupportImage: "رابط الصورة غير مدعوم مع الخيار \"%1\"",
			success: "تم حفظ التغييرات، هذه معاينة",
			reseted: "تم إعادة جميع الإعدادات للوضع الافتراضي",
			invalidAlpha: "الرجاء اختيار رقم من 0 -> 1"
		}
	},
	dhbc: {
		description: "لعب لعبة تخمين الكلمة",
		guide: "{pn}",
		text: {
			reply: "الرجاء الرد على هذه الرسالة بالإجابة\n%1",
			isSong: "هذا هو اسم أغنية للمطرب %1",
			notPlayer: "⚠️ أنت لست اللاعب المشارك في هذا السؤال",
			correct: "🎉 تهانينا! أجبت إجابة صحيحة وحصلت على %1$",
			wrong: "⚠️ إجابة خاطئة"
		}
	},
	emojimix: {
		description: "خلط رمزَيْ إيموجي معًا",
		guide: "   {pn} <emoji1> <emoji2>\n   مثال:  {pn} 🤣 🥰"
	},
	eval: {
		description: "اختبار كود سريعًا",
		guide: "{pn} <الكود للاختبار>",
		text: {
			error: "❌ حدث خطأ:"
		}
	},
	event: {
		description: "إدارة ملفات أوامر الحدث",
		guide: "{pn} load <اسم ملف الأمر>\n{pn} loadAll\n{pn} install <url> <اسم الملف>: تحميل وتثبيت أمر حدث من رابط (raw)",
		text: {
			missingFileName: "⚠️ | الرجاء إدخال اسم الأمر لإعادة التحميل",
			loaded: "✅ | تم تحميل أمر الحدث \"%1\" بنجاح",
			loadedError: "❌ | فشل تحميل أمر الحدث \"%1\" بالخطأ\n%2: %3",
			loadedSuccess: "✅ | تم تحميل أمر الحدث \"%1\" بنجاح",
			loadedFail: "❌ | فشل تحميل أمر الحدث \"%1\"\n%2",
			missingCommandNameUnload: "⚠️ | الرجاء إدخال اسم الأمر الذي تريد إزالته",
			unloaded: "✅ | تم إلغاء تحميل أمر الحدث \"%1\" بنجاح",
			unloadedError: "❌ | فشل إلغاء تحميل أمر الحدث \"%1\" بالخطأ\n%2: %3",
			missingUrlCodeOrFileName: "⚠️ | الرجاء إدخال الرابط أو الكود واسم ملف الأمر الذي تريد تثبيته",
			missingUrlOrCode: "⚠️ | الرجاء إدخال الرابط أو الكود لملف الأمر الذي تريد تثبيته",
			missingFileNameInstall: "⚠️ | الرجاء إدخال اسم الملف لحفظ الأمر (بلاحقة .js)",
			invalidUrlOrCode: "⚠️ | لا يمكن الحصول على كود الأمر",
			alreadExist: "⚠️ | الملف موجود بالفعل، هل تريد استبداله؟\nتفاعل مع هذه الرسالة للاستمرار",
			installed: "✅ | تم تثبيت أمر الحدث \"%1\" بنجاح، الملف محفوظ في %2",
			installedError: "❌ | فشل تثبيت أمر الحدث \"%1\" بالخطأ\n%2: %3",
			missingFile: "⚠️ | الملف \"%1\" غير موجود",
			invalidFileName: "⚠️ | اسم ملف غير صالح",
			unloadedFile: "✅ | تم إلغاء تحميل الأمر \"%1\""
		}
	},
	filteruser: {
		description: "تصفية أعضاء المجموعة حسب عدد الرسائل أو الحسابات المقفلة",
		guide: "   {pn} [<عدد الرسائل> | die]",
		text: {
			needAdmin: "⚠️ | الرجاء إضافة البوت كمسؤول للمجموعة لاستخدام هذا الأمر",
			confirm: "⚠️ | هل أنت متأكد من حذف الأعضاء الذين لديهم أقل من %1 رسالة؟\nتفاعل مع هذه الرسالة للتأكيد",
			kickByBlock: "✅ | تم حذف %1 من الأعضاء الذين لديهم حسابات مقفلة بنجاح",
			kickByMsg: "✅ | تم حذف %1 من الأعضاء الذين لديهم أقل من %2 رسالة بنجاح",
			kickError: "❌ | حدث خطأ ولم يتمكن من طرد %1 من الأعضاء:\n%2",
			noBlock: "✅ | لا يوجد أعضاء بحسابات مقفلة",
			noMsg: "✅ | لا يوجد أعضاء لديهم أقل من %1 رسالة"
		}
	},
	getfbstate: {
		description: "جلب حالة fb الحالية",
		guide: "{pn}",
		text: {
			success: "تم إرسال fbstate إليك، يرجى التحقق من رسالة البوت الخاصة"
		}
	},
	grouptag: {
		description: "تصنيف الأعضاء ضمن مجموعات تاج",
		guide: "   {pn} add <groupTagName> <@tags>: لإضافة مجموعة تاج جديدة أو إضافة أعضاء\n   مثال:\n    {pn} TEAM1 @tag1 @tag2\n\n   {pn} del <groupTagName> <@tags>: لإزالة أعضاء ...",
		text: {
			noGroupTagName: "الرجاء إدخال اسم مجموعة التاج",
			noMention: "لم تقم بتحديد أي عضو لإضافته إلى مجموعة التاج",
			addedSuccess: "تمت إضافة الأعضاء:\n%1\nإلى مجموعة التاج \"%2\"",
			addedSuccess2: "تمت إضافة مجموعة التاج \"%1\" مع الأعضاء:\n%2",
			existedInGroupTag: "الأعضاء:\n%1\nموجودون بالفعل في مجموعة التاج \"%2\"",
			notExistedInGroupTag: "الأعضاء:\n%1\nليسوا موجودين في مجموعة التاج \"%2\"",
			noExistedGroupTag: "مجموعة التاج \"%1\" غير موجودة في محادثتك",
			noExistedGroupTag2: "مجموعة المحادثة الخاصة بك لم تضف أي مجموعة تاج بعد",
			noMentionDel: "الرجاء الإشارة إلى الأعضاء لحذفهم من مجموعة التاج \"%1\"",
			deletedSuccess: "تم حذف الأعضاء:\n%1\nمن مجموعة التاج \"%2\"",
			deletedSuccess2: "تم حذف مجموعة التاج \"%1\"",
			tagged: "مناداة المجموعة \"%1\":\n%2",
			noGroupTagName2: "الرجاء إدخال الاسم القديم واسم المجموعة الجديد مفصولين بـ \"|\"",
			renamedSuccess: "تم إعادة تسمية مجموعة التاج \"%1\" إلى \"%2\"",
			infoGroupTag: "📑 | اسم المجموعة: \"%1\"\n👥 | عدد الأعضاء: %2\n👨‍👩‍👧‍👦 | قائمة الأعضاء:\n %3"
		}
	},
	help: {
		description: "عرض كيفية استخدام الأوامر",
		guide: "{pn} [فارغ | <رقم الصفحة> | <اسم الأمر>]",
		text: {
			help: "╭─────────────⭓\n%1\n├─────⭔\n│ صفحة [ %2/%3 ]\n│ حاليًا، البوت يحتوي على %4 أوامر قابلة للاستخدام\n│ » اكتب %5help <صفحة> لعرض الأوامر\n╰─────────────⭓",
			help2: "%1├───────⭔\n│ » حاليًا، البوت يحتوي على %2 أوامر قابلة للاستخدام\n│ » اكتب %3help <اسم الأمر> لعرض تفاصيل استخدام الأمر\n│ %4\n╰─────────────⭓",
			commandNotFound: "الأمر \"%1\" غير موجود",
			getInfoCommand: "╭── الاسم ────⭓\n│ %1\n├── المعلومات\n│ الوصف: %2\n│ أسماء أخرى: %3\n│ أسماء أخرى في مجموعتك: %4\n│ الإصدار: %5\n│ الدور: %6\n│ زمن كل أمر: %7\n╰─────────────⭓",
			doNotHave: "غير متوفر",
			roleText0: "0 (جميع المستخدمين)",
			roleText1: "1 (مدراء المجموعة)",
			roleText2: "2 (مدير البوت)",
			roleText0setRole: "0 (تعيين الدور، جميع المستخدمين)",
			roleText1setRole: "1 (تعيين الدور، مدراء المجموعة)",
			pageNotFound: "الصفحة %1 غير موجودة"
		}
	},
	kick: {
		description: "طرد عضو من المحادثة",
		guide: "{pn} @tags: لطرد الأعضاء المشار إليهم"
	},
	loadconfig: {
		description: "إعادة تحميل إعدادات البوت"
	},
	moon: {
		description: "عرض صورة القمر في الليلة التي تختارها (يوم/شهر/سنة)",
		guide: "  {pn} <يوم/شهر/سنة>\n   {pn} <يوم/شهر/سنة> <تعليق>",
		text: {
			invalidDateFormat: "الرجاء إدخال تاريخ صالح بصيغة DD/MM/YYYY",
			error: "حدث خطأ أثناء جلب صورة القمر لـ %1",
			invalidDate: "%1 ليس تاريخًا صالحًا",
			caption: "- صورة القمر في %1"
		}
	},
	notification: {
		description: "إرسال إشعار من مدير البوت إلى جميع المجموعات",
		guide: "{pn} <الرسالة>",
		text: {
			missingMessage: "الرجاء إدخال الرسالة التي تريد إرسالها إلى جميع المجموعات",
			notification: "إشعار من مدير البوت إلى جميع المحادثات (لا ترد على هذه الرسالة)",
			sendingNotification: "بدء إرسال الإشعارات إلى %1 مجموعة",
			sentNotification: "✅ تم إرسال الإشعار إلى %1 مجموعة بنجاح",
			errorSendingNotification: "حدث خطأ أثناء الإرسال إلى %1 مجموعة:\n %2"
		}
	},
	prefix: {
		description: "تغيير بادئة الأوامر في محادثتك أو على مستوى البوت (فقط مدراء البوت)",
		guide: "   {pn} <بادئة جديدة>: تغيير البادئة في محادثتك\n   مثال:\n    {pn} #\n\n   {pn} <بادئة جديدة> -g: تغيير البادئة على مستوى النظام (فقط مدراء البوت)\n   مثال:\n    {pn} # -g",
		text: {
			reset: "تم إعادة البادئة إلى الافتراضي: %1",
			onlyAdmin: "فقط مدراء البوت يمكنهم تغيير بادئة النظام",
			confirmGlobal: "الرجاء التفاعل مع هذه الرسالة لتأكيد تغيير البادئة على مستوى النظام",
			confirmThisThread: "الرجاء التفاعل مع هذه الرسالة لتأكيد تغيير البادئة في هذه المحادثة",
			successGlobal: "تم تغيير بادئة النظام إلى: %1",
			successThisThread: "تم تغيير البادئة في المحادثة إلى: %1",
			myPrefix: "🌐 بادئة النظام: %1\n🛸 بادئة محادثتك: %2"
		}
	},
	rank: {
		description: "عرض مستواك أو مستوى الشخص المشار إليه. يمكنك الإشارة لأكثر من شخص"
	},
	rankup: {
		description: "تفعيل/إيقاف إشعارات التقدم بالمستوى",
		guide: "{pn} [on | off]",
		text: {
			syntaxError: "خطأ في الصياغة، استخدم فقط {pn} on أو {pn} off",
			turnedOn: "تم تفعيل إشعارات الترقية بالمستوى",
			turnedOff: "تم إيقاف إشعارات الترقية بالمستوى",
			notiMessage: "🎉🎉 تهانينا لبلوغ المستوى %1"
		}
	},
	refresh: {
		description: "تحديث معلومات المحادثة أو المستخدم",
		guide: "   {pn} [thread | group]: تحديث معلومات محادثتك\n   {pn} group <threadID>: تحديث معلومات مجموعة بواسطة ID\n\n   {pn} user: تحديث معلومات المستخدم\n   {pn} ...",
		text: {
			refreshMyThreadSuccess: "✅ | تم تحديث معلومات محادثتك بنجاح!",
			refreshThreadTargetSuccess: "✅ | تم تحديث معلومات المحادثة %1 بنجاح!"
		}
	},
	rules: {
		description: "إنشاء/عرض/إضافة/تعديل/تغيير موضع/حذف قواعد مجموعتك",
		guide: "   {pn} [add | -a] <قواعد للاضافة>: إضافة قاعدة للمجموعة.\n   {pn}: عرض القواعد.\n   {pn} [edit | -e] <n> <المحتوى بعد التعديل>: تعديل القاعدة رقم n.\n   {pn} [move | -m] <م1> <م2> لتبديل مواضع..."
	},
	sendnoti: {
		description: "إنشاء وإرسال إشعارات للمجموعات التي تديرها",
		guide: "   {pn} create <groupName>: إنشاء مجموعة إشعار جديدة باسم <groupName>\n   مثال:\n    {pn} create TEAM1\n\n   {pn} add <groupName>: إضافة المحادثة الحالية إلى مجموعة الإشعار <groupName> ...",
		text: {
			missingGroupName: "الرجاء إدخال اسم مجموعة الإشعار",
			groupNameExists: "مجموعة إشعار بالاسم %1 قد أنشأتها مسبقًا، اختر اسمًا آخر",
			createdGroup: "تم إنشاء مجموعة الإشعار بنجاح:\n- الاسم: %1\n- ID: %2",
			missingGroupNameToAdd: "الرجاء إدخال اسم مجموعة الإشعار التي تريد إضافة هذه المحادثة إليها",
			groupNameNotExists: "لم تقم بإنشاء/إدارة أي مجموعة إشعار بالاسم: %1",
			notAdmin: "أنت لست مسؤولاً في هذه المحادثة",
			added: "تمت إضافة المحادثة الحالية إلى مجموعة الإشعار: %1",
			missingGroupNameToDelete: "الرجاء إدخال اسم مجموعة الإشعار التي تريد حذف هذه المحادثة منها",
			notInGroup: "المحادثة الحالية غير موجودة في مجموعة الإشعار %1",
			deleted: "تم حذف المحادثة الحالية من مجموعة الإشعار: %1",
			failed: "فشل إرسال الإشعار إلى %1 محادثات: \n%2",
			missingGroupNameToRemove: "الرجاء إدخال اسم مجموعة الإشعار التي تريد إزالتها",
			removed: "تمت إزالة مجموعة الإشعار: %1",
			missingGroupNameToSend: "الرجاء إدخال اسم مجموعة الإشعار التي تريد إرسال رسالة لها",
			groupIsEmpty: "مجموعة الإشعار \"%1\" فارغة",
			sending: "جاري إرسال الإشعار إلى %1 محادثات",
			success: "تم إرسال الإشعار إلى %1 محادثات في مجموعة \"%2\" بنجاح",
			notAdminOfGroup: "أنت لست مسؤولاً في هذه المجموعة",
			missingGroupNameToView: "الرجاء إدخال اسم مجموعة الإشعار لعرض معلوماتها",
			groupInfo: "- اسم المجموعة: %1\n - ID: %2\n - تاريخ الإنشاء: %3\n%4 ",
			groupInfoHasGroup: "- تحتوي على المحادثات التالية: \n%1",
			noGroup: "لم تقم بإنشاء/إدارة أي مجموعة إشعار"
		}
	},
	setalias: {
		description: "إضافة اختصار (اسم بديل) لأي أمر في مجموعتك",
		guide: "  هذا الأمر يُستخدم لإضافة/حذف اسم بديل لأي أمر في مجموعتك\n   {pn} add <alias> <command>: إضافة اسم بديل للأمر في مجموعتك\n   {pn} add <alias> <command> -g: إضافة اسم بديل على مستوى النظام"
	},
	setavt: {
		description: "تغيير صورة البوت",
		text: {
			cannotGetImage: "❌ | حدث خطأ أثناء جلب رابط الصورة",
			invalidImageFormat: "❌ | صيغة صورة غير صالحة",
			changedAvatar: "✅ | تم تغيير صورة البوت بنجاح"
		}
	},
	setlang: {
		description: "تعيين اللغة الافتراضية للبوت للمحادثة الحالية أو لجميع المحادثات",
		guide: "   {pn} <رمز اللغة ISO 639-1>\n   مثال:    {pn} en    {pn} vi    {pn} ja",
		text: {
			setLangForAll: "تم تعيين اللغة الافتراضية لجميع المحادثات: %1",
			setLangForCurrent: "تم تعيين لغة المحادثة الحالية: %1",
			noPermission: "فقط مدير البوت يمكنه استخدام هذا الأمر"
		}
	},
	setleave: {
		description: "تعديل/تفعيل/إيقاف رسالة الخروج عند مغادرة عضو مجموعتك",
		guide: {
			body: "   {pn} on: تفعيل رسالة الخروج\n   {pn} off: إيقاف رسالة الخروج\n   {pn} text [<المحتوى> | reset]: تحرير النص أو إعادة التعيين للافتراضي، الاختصارات المتاحة:\n  + {userName}: اسم العضو\n  + {userNameTag}: اسم العضو مع إشارة\n  + {boxName}: اسم المجموعة",
			attachment: {
				[`${process.cwd()}/scripts/cmds/assets/guide/setleave/setleave_en_1.png`]: "https://i.ibb.co/2FKJHJr/guide1.png"
			}
		},
		text: {
			missingContent: "الرجاء إدخال المحتوى",
			edited: "تم تعديل رسالة الخروج في مجموعتك إلى:\n%1",
			reseted: "تم إعادة ضبط رسالة الخروج",
			noFile: "لا يوجد ملف مرفق لرسالة الخروج ليتم إعادة تعيينه",
			resetedFile: "تم إعادة تعيين ملف مرفق رسالة الخروج بنجاح",
			missingFile: "الرجاء الرد على هذه الرسالة بملف صورة/فيديو/صوت",
			addedFile: "تمت إضافة %1 ملفًا مُرفقًا لرسالة الخروج الخاصة بمجموعتك"
		}
	},
	setname: {
		description: "تغيير ألقاب الأعضاء في الدردشة أو الأعضاء المشار إليهم بتنسيق",
		guide: {
			body: "   {pn} <اللقب>: تغيير لقبك\n   {pn} @tags <اللقب>: تغيير لقب الأعضاء المشار إليهم\n   {pn} all <اللقب>: تغيير لقب جميع أعضاء المحادثة\n\nمع الخيارات المتاحة...",
			attachment: {
				[`${process.cwd()}/scripts/cmds/assets/guide/setname_1.png`]: "https://i.ibb.co/gFh23zb/guide1.png",
				[`${process.cwd()}/scripts/cmds/assets/guide/setname_2.png`]: "https://i.ibb.co/BNWHKgj/guide2.png"
			}
		},
		text: {
			error: "حدث خطأ، حاول إيقاف رابط الدعوة في المجموعة ثم أعد المحاولة لاحقًا"
		}
	},
	setrole: {
		description: "تعديل دور الأمر (الأوامر ذات الدور < 2)",
		guide: "   {pn} <commandName> <new role>: تعيين دور جديد للأمر\n   حيث:\n   + <commandName>: اسم الأمر\n   + <new role>: الدور الجديد مع:\n   + <new role> = 0: يمكن استخدام الأمر من قبل الجميع\n   + <new role> = 1: المسؤولون فقط\n   + <new role> = 2: مشرف البوت",
		text: {
			noEditedCommand: "✅ لم تقم بتعديل أي أوامر في مجموعتك",
			editedCommand: "⚠️ أوامرك المعدلة في مجموعتك:\n",
			noPermission: "❗ فقط المسؤولون يمكنهم استخدام هذا الأمر",
			commandNotFound: "الأمر \"%1\" غير موجود",
			noChangeRole: "❗ لا يمكن تغيير دور الأمر \"%1\"",
			resetRole: "تم إعادة دور الأمر \"%1\" إلى الافتراضي",
			changedRole: "تم تغيير دور الأمر \"%1\" إلى %2"
		}
	},
	setwelcome: {
		description: "تعديل رسالة الترحيب عند انضمام عضو جديد لمجموعتك",
		guide: {
			body: "   {pn} text [<المحتوى> | reset]: تعديل نص الترحيب أو إعادة تعيينه للافتراضي، مع بعض الاختصارات:\n  + {userName}: اسم العضو الجديد\n  + {userNameTag}: اسم العضو مع إشارة\n  + {boxName}: اسم المجموعة\n  + ...",
			attachment: {
				[`${process.cwd()}/scripts/cmds/assets/guide/setwelcome/setwelcome_en_1.png`]: "https://i.ibb.co/vsCz0ks/setwelcome-en-1.png"
			}
		},
		text: {
			missingContent: "الرجاء إدخال محتوى رسالة الترحيب",
			edited: "تم تعديل رسالة الترحيب لمجموعتك إلى: %1",
			reseted: "تم إعادة ضبط رسالة الترحيب",
			noFile: "لا يوجد مرفقات لحذفها",
			resetedFile: "تم إعادة تعيين المرفقات بنجاح",
			missingFile: "الرجاء الرد على هذه الرسالة بملف صورة/فيديو/صوت",
			addedFile: "تمت إضافة %1 مرفقات إلى رسالة الترحيب في مجموعتك"
		}
	},
	shortcut: {
		description: "إضافة اختصار لرسالتك في الدردشة",
		text: {
			missingContent: 'الرجاء إدخال محتوى الرسالة',
			shortcutExists: 'الاختصار "%1" موجود بالفعل، تفاعل مع هذه الرسالة لاستبدال المحتوى',
			shortcutExistsByOther: 'الاختصار %1 أضافه عضو آخر، حاول كلمة مفتاحية أخرى',
			added: 'تم إضافة الاختصار %1 => %2',
			addedAttachment: ' مع %1 مرفق(ات)',
			missingKey: 'الرجاء إدخال الكلمة المفتاحية للاختصار الذي تريد حذفه',
			notFound: 'لم يتم العثور على اختصار بالكلمة %1 في مجموعتك',
			onlyAdmin: 'فقط المسؤولون يمكنهم حذف اختصارات الآخرين',
			deleted: 'تم حذف الاختصار %1',
			empty: 'لم تضف مجموعتك أي اختصارات بعد',
			message: 'الرسالة',
			attachment: 'المرفق',
			list: 'قائمة اختصارات مجموعتك',
			onlyAdminRemoveAll: 'فقط المسؤولون يمكنهم إزالة كل الاختصارات في المجموعة',
			confirmRemoveAll: 'هل أنت متأكد من إزالة كل الاختصارات في هذه المحادثة؟ (تفاعل مع هذه الرسالة للتأكيد)',
			removedAll: 'تمت إزالة كل الاختصارات في محادثتك'
		}
	},
	simsimi: {
		description: "الدردشة مع simsimi",
		guide: "   {pn} [on | off]: تفعيل/إيقاف simsimi\n\n   {pn} <كلمة>: الدردشة مع simsimi\n   مثال:\n    {pn} hi",
		text: {
			turnedOn: "تم تفعيل simsimi بنجاح!",
			turnedOff: "تم إيقاف simsimi بنجاح!",
			chatting: "جارٍ الدردشة مع simsimi...",
			error: "simsimi مشغول، حاول مرة أخرى لاحقًا"
		}
	},
	sorthelp: {
		description: "ترتيب قائمة المساعدة",
		guide: "{pn} [name | category]",
		text: {
			savedName: "تم حفظ ترتيب المساعدة بحسب الاسم",
			savedCategory: "تم حفظ ترتيب المساعدة بحسب الفئة"
		}
	},
	thread: {
		description: "إدارة دردشات المجموعات في نظام البوت",
		guide: "   {pn} [find | -f | search | -s] <الاسم للبحث>: البحث في بيانات البوت عن مجموعات بالاسم\n   {pn} [find | -f | search | -s] [-j | joined] <الاسم>: البحث في المجموعات التي انضم إليها البوت ...",
		text: {
			noPermission: "ليس لديك الصلاحية لاستخدام هذه الميزة",
			found: "🔎 تم العثور على %1 مجموعة تطابق الكلمة \"%3\" في بيانات البوت:\n%3",
			notFound: "❌ لم يتم العثور على مجموعة تطابق الكلمة: \"%1\" في بيانات البوت",
			hasBanned: "المجموعة ذات المعرف [%1 | %2] مُنعت سابقًا:\n» السبب: %3\n» الوقت: %4",
			banned: "تم حظر المجموعة ذات المعرف [%1 | %2] من استخدام البوت.\n» السبب: %3\n» الوقت: %4",
			notBanned: "المجموعة ذات المعرف [%1 | %2] غير محظورة من استخدام البوت",
			unbanned: "تم رفع الحظر عن المجموعة ذات المعرف [%1 | %2] لاستخدام البوت",
			missingReason: "سبب الحظر لا يمكن أن يكون فارغًا",
			info: "» Box ID: %1\n» الاسم: %2\n» تاريخ إضافة البيانات: %3\n» إجمالي الأعضاء: %4\n» ذكور: %5 أعضاء\n» إناث: %6 أعضاء\n» إجمالي الرسائل: %7%8"
		}
	},
	tid: {
		description: "عرض ThreadID لمحادثتك",
		guide: "{pn}"
	},
	tik: {
		description: "تحميل فيديو/شرائح (صور)، صوت من رابط تيك توك",
		guide: "   {pn} [video|-v|v] <url>: تحميل فيديو/شرائح من رابط تيك توك.\n   {pn} [audio|-a|a] <url>: تحميل الصوت من رابط تيك توك",
		text: {
			invalidUrl: "الرجاء إدخال رابط تيك توك صالح",
			downloadingVideo: "جارٍ تنزيل الفيديو: %1...",
			downloadedSlide: "تم تنزيل الشريحة: %1\n%2",
			downloadedVideo: "تم تنزيل الفيديو: %1\nرابط التحميل: %2",
			downloadingAudio: "جارٍ تنزيل الصوت: %1...",
			downloadedAudio: "تم تنزيل الصوت: %1"
		}
	},
	trigger: {
		description: "صورة التحفيز (trigger)",
		guide: "{pn} [@tag | فارغ]"
	},
	uid: {
		description: "عرض معرف فيسبوك للمستخدم",
		guide: "   {pn}: عرض معرفك\n   {pn} @tag: عرض معرف الشخص المشار إليه\n   {pn} <رابط البروفايل>: عرض معرف رابط الملف الشخصي",
		text: {
			syntaxError: "الرجاء الإشارة للشخص الذي تريد عرض معرفه أو تركه فارغًا لعرض معرفك"
		}
	},
	unsend: {
		description: "التراجع عن إرسال رسالة البوت",
		guide: "رد على الرسالة التي تريد التراجع عنها ثم استدعاء الأمر {pn}",
		text: {
			syntaxError: "الرجاء الرد على الرسالة التي تريد التراجع عنها"
		}
	},
	user: {
		description: "إدارة المستخدمين في نظام البوت",
		guide: "   {pn} [find | -f | search | -s] <الاسم للبحث>: البحث عن المستخدمين في بيانات البوت بالاسم\n\n   {pn} [ban | -b] [<uid> | @tag | رد على رسالة] <السبب>: حظر مستخدم ...",
		text: {
			noUserFound: "❌ لم يتم العثور على مستخدم باسم مطابق: \"%1\" في بيانات البوت",
			userFound: "🔎 تم العثور على %1 مستخدم يطابق الاسم \"%2\" في بيانات البوت:\n%3",
			uidRequired: "معرف المستخدم للحظر لا يمكن أن يكون فارغًا، الرجاء إدخال uid أو الإشارة أو الرد على رسالة",
			reasonRequired: "سبب الحظر لا يمكن أن يكون فارغًا، الرجاء إدخال سبب للحظر",
			userHasBanned: "المستخدم بالمعرف [%1 | %2] محظور مسبقًا:\n» السبب: %3\n» التاريخ: %4",
			userBanned: "المستخدم بالمعرف [%1 | %2] تم حظره:\n» السبب: %3\n» التاريخ: %4",
			uidRequiredUnban: "معرف المستخدم لفك الحظر لا يمكن أن يكون فارغًا",
			userNotBanned: "المستخدم بالمعرف [%1 | %2] غير محظور",
			userUnbanned: "تم فك الحظر عن المستخدم بالمعرف [%1 | %2]"
		}
	},
	videofb: {
		description: "تحميل فيديو/قصة من فيسبوك (عام)",
		guide: "   {pn} <رابط الفيديو/القصة من فيسبوك>: تحميل الفيديو",
		text: {
			missingUrl: "الرجاء إدخال رابط فيديو/قصة فيسبوك العام الذي تريد تحميله",
			error: "حدث خطأ أثناء تنزيل الفيديو",
			downloading: "جارٍ تنزيل الفيديو لك",
			tooLarge: "عذرًا، لا نستطيع تنزيل الفيديو لأنه أكبر من 83MB"
		}
	},
	warn: {
		description: "تحذير عضو في المجموعة؛ إذا وصل إلى 3 تحذيرات سيتم حظره",
		guide: "   {pn} @tag <السبب>: تحذير عضو\n   {pn} list: عرض قائمة المحذوفين\n   {pn} listban: عرض قائمة المحظورين\n   {pn} info [@tag | <uid> | فارغ]: عرض معلومات التحذيرات ...",
		text: {
			list: "قائمة الأعضاء الذين تم تحذيرهم:\n%1\n\nلعرض تفاصيل التحذيرات، استخدم الأمر \"%2warn info [@tag | <uid> | فارغ]\"",
			listBan: "قائمة الأعضاء الذين تم تحذيرهم 3 مرات وحُظروا من المجموعة:\n%1",
			listEmpty: "لا توجد أي تحذيرات في مجموعتك",
			listBanEmpty: "لا يوجد محظورون من المجموعة",
			invalidUid: "الرجاء إدخال uid صالح للشخص الذي تريد عرض معلوماته",
			noData: "لا توجد بيانات",
			noPermission: "❌ فقط مدراء المجموعة يمكنهم فك حظر الأعضاء المحظورين",
			invalidUid2: "⚠️ الرجاء إدخال uid صالح للشخص الذي تريد فك حظره",
			notBanned: "⚠️ المستخدم بالمعرف %1 لم يُحظر من مجموعتك",
			unbanSuccess: "✅ تم فك حظر العضو [%1 | %2] بنجاح، الآن يمكنه الانضمام للمجموعة",
			noPermission2: "❌ فقط مدراء المجموعة يمكنهم إزالة التحذيرات",
			invalidUid3: "⚠️ الرجاء إدخال uid أو الإشارة للشخص الذي تريد إزالة التحذير عنه",
			noData2: "⚠️ المستخدم بالمعرف %1 لا يملك بيانات تحذير",
			notEnoughWarn: "❌ المستخدم %1 لديه فقط %2 تحذيرات",
			unwarnSuccess: "✅ تم إزالة %1 تحذير من العضو [%2 | %3] بنجاح",
			noPermission3: "❌ فقط مدراء المجموعة يمكنهم إعادة ضبط بيانات التحذير",
			resetWarnSuccess: "✅ تم إعادة ضبط بيانات التحذير بنجاح",
			noPermission4: "❌ فقط مدراء المجموعة يمكنهم تحذير الأعضاء",
			invalidUid4: "⚠️ يجب الإشارة أو الرد على رسالة الشخص الذي تريد تحذيره",
			warnSuccess: "⚠️ تم تحذير العضو %1 مرات %2\n- Uid: %3\n- السبب: %4\n- التاريخ: %5\nهذا العضو تم تحذيره 3 مرات وتم حظره من المجموعة، لفك الحظر استخدم الأمر \"%6warn unban <uid>\"",
			noPermission5: "⚠️ البوت يحتاج صلاحيات مدير لطرد الأعضاء المحظورين",
			warnSuccess2: "⚠️ تم تحذير العضو %1 مرات %2\n- Uid: %3\n- السبب: %4\n- التاريخ: %5\nإذا كرر المخالفة %6 مرات أخرى سيتم حظره من المجموعة",
			hasBanned: "⚠️ الأعضاء التالية أُحظروا بعد 3 تحذيرات:\n%1",
			failedKick: "⚠️ حدث خطأ عند طرد الأعضاء التالية أسماؤهم:\n%1"
		}
	},
	weather: {
		description: "عرض الطقس الحالي وتوقعات الخمسة أيام القادمة",
		guide: "{pn} <الموقع>",
		text: {
			syntaxError: "الرجاء إدخال موقع",
			notFound: "الموقع غير موجود: %1",
			error: "حدث خطأ: %1",
			today: "طقس اليوم:\n%1\n🌡 أدنى - أعلى درجة حرارة %2°C - %3°C\n🌡 الإحساس الحراري %4°C - %5°C\n🌅 شروق الشمس %6\n🌄 غروب الشمس %7\n🌃 شروق القمر %8\n🏙️ غروب القمر %9\n🌞 النهار: %10\n🌙 الليل: %11"
		}
	},
	ytb: {
		description: "تحميل فيديو، صوت أو عرض معلومات فيديو من يوتيوب",
		guide: "   {pn} [video|-v] [<اسم الفيديو>|<رابط الفيديو>]: تحميل فيديو من يوتيوب.\n   {pn} [audio|-a] [<اسم الفيديو>|<رابط الفيديو>]: تحميل صوت من يوتيوب\n   {pn} [info|-i] [<...>]",
		text: {
			error: "حدث خطأ: %1",
			noResult: "لا توجد نتائج تطابق الكلمة %1",
			choose: "%1رد على الرسالة بالرقم للاختيار أو أي محتوى للإلغاء",
			downloading: "جارٍ تنزيل الفيديو %1",
			noVideo: "عذرًا، لم يتم العثور على فيديو بحجم أقل من 83MB",
			downloadingAudio: "جارٍ تنزيل الصوت %1",
			noAudio: "عذرًا، لم يتم العثور على صوت بحجم أقل من 26MB",
			info: "💠 العنوان: %1\n🏪 القناة: %2\n👨‍👩‍👧‍👦 المشتركون: %3\n⏱ مدة الفيديو: %4\n👀 المشاهدات: %5\n👍 الإعجابات: %6\n🆙 تاريخ الرفع: %7\n🔠 المعرف: %8\n🔗 الرابط: %9",
			listChapter: "\n📖 قائمة الفصول: %1\n"
		}
	}
};